calendar/app/controllers/appointments_controller.rb

  def index
    @appointment = Appointment.new
    @appointments = Appointment.order(appt_time: :asc)
---
SELECT "appointments".* FROM "appointments" ORDER BY "appointments"."appt_time" ASC

  def create
    @appointment = Appointment.create(appointment_params)
---
INSERT INTO "appointments" ("title", "appt_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Meet Joe"], ["appt_time", "2017-01-25 11:00:00"], ["created_at", "2018-07-07 21:07:57.075278"], ["updated_at", "2018-07-07 21:07:57.075278"]]